Revit 2024 API
MetallicPaint.MetallicpaintBaseColorByObject Property
 The property labeled "Color By Object" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MetallicpaintBaseColorByObject { get; }
Visual Basic
Public Shared ReadOnly Property MetallicpaintBaseColorByObject As String
	Get
Visual C++
public:
static property String^ MetallicpaintBaseColorByObject {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace